{
  "books": [
    {
      "id": "1",
      "title": "Harry Potter and the Sorcerer's Stone",
      "author": "J.K. Rowling",
      "price": 10.99,
      "pageCount": 309,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/71RVt35ZAbL._SY385_.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Harry Potter and the Philosopher's Stone is a fantasy novel written by British author J. K. Rowling. The first novel in the Harry Potter series and Rowling's debut novel, it follows Harry Potter, a young wizard who discovers his magical heritage on his eleventh birthday, when he receives a letter of acceptance to Hogwarts School of Witchcraft and Wizardry. Harry makes close friends and a few enemies during his first year at the school, and with the help of his friends, Harry faces an attempted comeback by the dark wizard Lord Voldemort, who killed Harry's parents, but failed to kill Harry when he was just 15 months old."
    },
    {
      "id": "2",
      "title": "Harry Potter and the Chamber of Secrets",
      "author": "J.K. Rowling",
      "price": 12.99,
      "pageCount": 341,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/81Wbfijio4L._SY385_.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Harry Potter and the Chamber of Secrets is a fantasy novel written by British author J. K. Rowling and the second novel in the Harry Potter series. The plot follows Harry's second year at Hogwarts School of Witchcraft and Wizardry, during which a series of messages on the walls of the school's corridors warn that the 'Chamber of Secrets' has been opened and that the 'heir of Slytherin' would kill all pupils who do not come from all-magical families. These threats are followed by attacks which leave residents of the school petrified. Throughout the year, Harry and his friends Ron and Hermione investigate the attacks."
    },
    {
      "id": "3",
      "title": "Harry Potter and the Prisoner of Azkaban",
      "author": "J.K. Rowling",
      "price": 14.99,
      "pageCount": 386,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/71NaVwWsRDL._SY385_.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Harry Potter and the Prisoner of Azkaban is a fantasy novel written by British author J. K. Rowling and the third in the Harry Potter series. The book follows Harry Potter, a young wizard, in his third year at Hogwarts School of Witchcraft and Wizardry. Along with friends Ronald Weasley and Hermione Granger, Harry investigates Sirius Black, an escaped prisoner from Azkaban who they believe is one of Lord Voldemort's old allies."
    },
    {
      "id": "4",
      "title": "Harry Potter and the Goblet of Fire",
      "author": "J.K. Rowling",
      "price": 16.99,
      "pageCount": 672,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/61m99NmM4jL.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Harry Potter and the Goblet of Fire is a fantasy book written by British author J. K. Rowling and the fourth novel in the Harry Potter series. It follows Harry Potter, a wizard in his fourth year at Hogwarts School of Witchcraft and Wizardry, and the mystery surrounding the entry of Harry's name into the Triwizard Tournament, in which he is forced to compete."
    },
    {
      "id": "5",
      "title": "Harry Potter and the Order of the Phoenix",
      "author": "J.K. Rowling",
      "price": 18.99,
      "pageCount": 870,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/71pgI2ou5oL._SY342_.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false", 
      "bio": "Harry Potter and the Order of the Phoenix is a fantasy novel written by British author J. K. Rowling and the fifth novel in the Harry Potter series. It follows Harry Potter's struggles through his fifth year at Hogwarts School of Witchcraft and Wizardry, including the surreptitious return of the antagonist Lord Voldemort, O.W.L. exams, and an obstructive Ministry of Magic."
    },
    {
      "id": "6",
      "title": "Harry Potter and the Half-Blood Prince",
      "author": "J.K. Rowling",
      "price": 19.99,
      "pageCount": 652,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/51sImF7gqML.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Harry Potter and the Half-Blood Prince is a fantasy novel written by British author J. K. Rowling and the sixth and penultimate novel in the Harry Potter series. Set during Harry Potter's sixth year at Hogwarts, the novel explores the past of Harry's nemesis, Lord Voldemort, and Harry's preparations for the final battle against Voldemort alongside his headmaster and mentor Albus Dumbledore."
    },
    {
      "id": "7",
      "title": "Harry Potter and the Deathly Hallows",
      "author": "J.K. Rowling",
      "price": 21.99,
      "pageCount": 759,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/61yMjtQzKcL.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Harry Potter and the Deathly Hallows is a fantasy novel written by British author J. K. Rowling and the seventh and final novel of the Harry Potter series. The book was released on 21 July 2007, ending the series that began in 1997 with the publication of Harry Potter and the Philosopher's Stone. It was published in the United Kingdom by Bloomsbury Publishing, in the United States by Scholastic, and in Canada by Raincoast Books. The novel chronicles the events directly following Harry Potter and the Half-Blood Prince (2005) and the final confrontation between the wizards Harry Potter and Lord Voldemort."
    },
    {
      "id": "8",
      "title": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "price": 14.99,
      "pageCount": 322,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/511D+omqzzL.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Hobbit, or There and Back Again is a children's fantasy novel by English author J. R. R. Tolkien. It was published on 21 September 1937 to wide critical acclaim, being nominated for the Carnegie Medal and awarded a prize from the New York Herald Tribune for best juvenile fiction. The book remains popular and is recognized as a classic in children's literature."
    },
    {
      "id": "9",
      "title": "The Lion, the Witch and the Wardrobe",
      "author": "C.S. Lewis",
      "price": 12.99,
      "pageCount": 208,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/518I4D+fBgL.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Lion, the Witch and the Wardrobe is a fantasy novel for children by C. S. Lewis, published by Geoffrey Bles in 1950. It is the first published and best known of seven novels in The Chronicles of Narnia (1950–1956). Among all the author's books, it is also the most widely held in libraries. Although it was originally the first of The Chronicles of Narnia, it is volume two in recent editions, which are sequenced by the stories' chronology (the first being The Magician's Nephew)."
    },
    {
      "id": "10",
      "title": "Prince Caspian",
      "author": "C.S. Lewis",
      "price": 13.99,
      "pageCount": 240,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/71ymmgaj3YL._SY342_.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Prince Caspian (originally published as Prince Caspian: The Return to Narnia) is a high fantasy novel for children by C. S. Lewis, published by Geoffrey Bles in 1951. It was the second published of seven novels in The Chronicles of Narnia (1950–1956), and Lewis had finished writing it in 1949, before the first book was out. It is volume four in recent editions of the series, sequenced according to Narnia history. Like the others, it was illustrated by Pauline Baynes and her work has been retained in many later editions."
    },
    {
      "id": "11",
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "author": "J.R.R. Tolkien",
      "price": 14.99,
      "pageCount": 423,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/71bocXHoUvL._SY342_.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Fellowship of the Ring is the first of three volumes of the epic novel The Lord of the Rings by the English author J. R. R. Tolkien. It is followed by The Two Towers and The Return of the King. It takes place in the fictional universe of Middle-earth. It was originally published on 29 July 1954 in the United Kingdom. The volume consists of a foreword, in which the author discusses his writing of The Lord of the Rings, a prologue titled Concerning Hobbits, and other matters, and the main narrative in Book I and Book II."
    },
    {
      "id": "12",
      "title": "The Lord of the Rings: The Two Towers",
      "author": "J.R.R. Tolkien",
      "price": 15.99,
      "pageCount": 454,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/81HfbQ8F2UL._SY342_.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Two Towers is the second volume of J. R. R. Tolkien's high fantasy novel The Lord of the Rings. It is preceded by The Fellowship of the Ring and followed by The Return of the King."
    },
    {
      "id": "13",
      "title": "The Lord of the Rings: The Return of the King",
      "author": "J.R.R. Tolkien",
      "price": 16.99,
      "pageCount": 544,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/51VYSm49SUL._SY445_SX342_.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Return of the King is the third and final volume of J. R. R. Tolkien's The Lord of the Rings, following The Fellowship of the Ring and The Two Towers. The story begins in the kingdom of Gondor, which is soon to be attacked by the Dark Lord Sauron."
    },
    {
      "id": "14",
      "title": "The Hobbit Illustrated",
      "author": "J.R.R. Tolkien",
      "price": 12.99,
      "pageCount": 310,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/51phEoA5C9L._SY445_SX342_.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Hobbit, or There and Back Again is a children's fantasy novel by English author J. R. R. Tolkien. It was published on 21 September 1937 to wide critical acclaim, being nominated for the Carnegie Medal and awarded a prize from the New York Herald Tribune for best juvenile fiction. The book remains popular and is recognized as a classic in children's literature."
    },
    {
      "id": "15",
      "title": "The Silmarillion",
      "author": "J.R.R. Tolkien",
      "price": 19.99,
      "pageCount": 365,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/81OIMHStUHL._AC_UY218_.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Silmarillion is a collection of mythopoeic works by English writer J. R. R. Tolkien, edited and published posthumously by his son, Christopher Tolkien, in 1977, with assistance from Guy Gavriel Kay. The Silmarillion, along with J. R. R. Tolkien's other works, forms an extensive, though incomplete, narrative that describes the universe of Eä in which are found the lands of Valinor, Beleriand, Númenor, and Middle-earth, within which The Hobbit and The Lord of the Rings take place."
    },
    {
      "id": "16",
      "title": "Unfinished Tales of Numenor and Middle-Earth",
      "author": "J.R.R. Tolkien",
      "price": 17.99,
      "pageCount": 482,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/51eDUv5pCCS.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Unfinished Tales of Númenor and Middle-earth is a collection of stories and essays by J. R. R. Tolkien that were never completed during his lifetime, but were edited by his son Christopher Tolkien and published in 1980."
    },
    {
      "id": "17",
      "title": "The Children of Húrin",
      "author": "J.R.R. Tolkien",
      "price": 16.99,
      "pageCount": 245,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/51CoWEe8HmL.jpg",
      "genre": "Fantasy",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Children of Húrin is an epic fantasy novel which forms the completion of a tale by J. R. R. Tolkien. He wrote the original version of the story in the late 1910s, revised it several times later, but did not complete it before his death in 1973. His son, Christopher Tolkien, edited the manuscripts to form a consistent narrative, and published it in 2007 as an independent work."
    },
    {
      "id": "18",
      "title": "Think and Grow Rich",
      "author": "Napoleon Hill",
      "price": 14.99,
      "pageCount": 278,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/61atv8Q26iL.jpg",
      "genre": "Self-Help",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Think and Grow Rich was written by Napoleon Hill in 1937 and promoted as a personal development and self-improvement book. He claimed to be inspired by a suggestion from business magnate and later-philanthropist Andrew Carnegie."
    },
    {
      "id": "19",
      "title": "48 Laws of Power",
      "author": "Robert Greene",
      "price": 16.99,
      "pageCount": 448,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/41dTDMW9IhL.jpg",
      "genre": "Self-Help",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The 48 Laws of Power is a non-fiction book by American author Robert Greene. The book is a bestseller, selling over 1.2 million copies in the United States, and is popular with prison inmates and celebrities."
    },
    {
      "id": "20",
      "title": "I Will Teach You to Be Rich",
      "author": "Ramit Sethi",
      "price": 19.99,
      "pageCount": 320,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/41ZjrXz3nQL.jpg",
      "genre": "Personal Finance",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "I Will Teach You to Be Rich is a 2009 personal finance book by Ramit Sethi. The book advises personal finance basics—such as saving, budgeting and investing—in addition to advice on how to negotiate salaries and raise incomes."
    },
    {
      "id": "21",
      "title": "The Subtle Art of Not Giving a F*ck",
      "author": "Mark Manson",
      "price": 13.99,
      "pageCount": 231,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/51MT0MbpD7L.jpg",
      "genre": "Self-Help",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life is the second book by blogger and author Mark Manson. In it Manson argues that life's struggles give it meaning, and that the mindless positivity of typical self-help books is neither practical nor helpful. It was a bestseller."
    },
    {
      "id": "22",
      "title": "The Winner Effect",
      "author": "Mike Cannon-Brookes",
      "price": 17.99,
      "pageCount": 288,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/41DWh1hRxoL._SY445_SX342_.jpg",
      "genre": "Self-Help",
      "readStatus": "Read",
      "favorite": "false",
      "bio": "The Winner Effect: The Neuroscience of Success and Failure is a book by Ian H. Robertson, Professor of Psychology at Trinity College Dublin, which was published in 2012. The book explores how success changes the chemistry of the brain, making people more focused, smarter, more confident—and aggressive."
    },
    {
      "id": "23",
      "title": "The Challenger Sale",
      "author": "Brent Adamson, Matthew Dixon, Pat Lencioni",
      "price": 18.99,
      "pageCount": 240,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/41Zs-2qu8OL.jpg",
      "genre": "Sales",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Challenger Sale: Taking Control of the Customer Conversation is a book by Matthew Dixon and Brent Adamson, based on an empirical study of thousands of sales reps across multiple industries and geographies. The book examines the changing face of sales, and argues that the relationship between salespeople and customers has changed significantly during the last decade."
    },
    {
      "id": "24",
      "title": "How to Win Friends and Influence People",
      "author": "Dale Carnegie",
      "price": 15.99,
      "pageCount": 304,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/51PWIy1rHUL.jpg",
      "genre": "Self-Help",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "How to Win Friends and Influence People is a self-help book written by Dale Carnegie, published in 1936. Over 30 million copies have been sold worldwide, making it one of the best-selling books of all time. In 2011, it was number 19 on Time Magazine's list of the 100 most influential books."
    },
    {
      "id": "25",
      "title": "Presuasion",
      "author": "Robert Cialdini",
      "price": 15.99,
      "pageCount": 320,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/51gqP7-wMsL.jpg",
      "genre": "Self-Help, Psychology",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Pre-Suasion: A Revolutionary Way to Influence and Persuade is a 2016 book by Robert Cialdini. The book explains the art of effective persuasion—the process of arranging for recipients to be receptive to a message before they encounter it."
    },
    {
      "id": "26",
      "title": "Emotional Intelligence 2.0",
      "author": "Travis Bradberry, Jean Greaves",
      "price": 16.99,
      "pageCount": 256,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/51JNVVaYlNL.jpg",
      "genre": "Self-Help, Psychology",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Emotional Intelligence 2.0 is a book by Travis Bradberry and Jean Greaves. The book is a sequel to the 2009 book Emotional Intelligence and has been translated into 25 languages. It has sold over 1.5 million copies worldwide."
    },
    {
      "id": "27",
      "title": "Rich Dad, Poor Dad",
      "author": "Robert Kiyosaki",
      "price": 14.99,
      "pageCount": 272,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/51AHZGhzZEL.jpg",
      "genre": "Personal Finance, Business, Self-Help",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Rich Dad Poor Dad is a 1997 book written by Robert Kiyosaki and Sharon Lechter. It advocates the importance of financial literacy, financial independence and building wealth through investing in assets, real estate investing, starting and owning businesses, as well as increasing one's financial intelligence to improve one's business and financial aptitude."
    },
    {
      "id": "28",
      "title": "The Intelligent Investor",
      "author": "Benjamin Graham",
      "price": 19.99,
      "pageCount": 614,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/41apexh1AhL.jpg",
      "genre": "Personal Finance",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "The Intelligent Investor by Benjamin Graham, first published in 1949, is a widely acclaimed book on value investing. The book teaches readers strategies on how to successfully use value investing in the stock market. The approach of the book is based on the philosophy that 'investment is most intelligent when it is most businesslike'."
    },
    {
      "id": "29",
      "title": "Sleight of Mouth",
      "author": "Robert Dilts",
      "price": 17.99,
      "pageCount": 384,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/41qrpS+b2XL._SY445_SX342_.jpg",
      "genre": "Self-Help, Pyschology",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Sleight of Mouth is a persuasion skill, a vehicle for the reframing of beliefs. It is a system of 14 different patterns of response to a stated belief. A system that, once mastered, can allow you to always have a response that will effectively elucidate your position and help you to persuade rather than be persuaded."
    },
    {
      "id": "30",
      "title": "Comedy Writing Secrets",
      "author": "Mel Helitzer",
      "price": 18.99,
      "pageCount": 240,
      "imageUrl": "https://m.media-amazon.com/images/W/MEDIAX_849526-T1/images/I/41st4iL7nlL._SY445_SX342_.jpg",
      "genre": "Humor, Self-Help",
      "readStatus": "Unread",
      "favorite": "false",
      "bio": "Comedy Writing Secrets is a book by Melvin Helitzer, a comedy writing professor at Ohio University. The book teaches the fundamentals of joke writing, with chapters dedicated to each of the fundamental principles of humor. The book is used as a textbook in some college-level comedy writing courses."
    }
  ]
}
